app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = ? AND "cards"."id" = ? LIMIT 1  [["deck_id", 2], ["id", "1"]]
---
	def show
	 	@deck = find_deck
	 	# @cards = Card.find(params[:id])
	 	@cards = @deck.cards.find(params[:id])

INSERT INTO "cards" ("back", "created_at", "deck_id", "front", "updated_at") VALUES (?, ?, ?, ?, ?)  [["back", "back card"], ["created_at", Tue, 18 Nov 2014 16:43:18 UTC +00:00], ["deck_id", 12], ["front", "front card"], ["updated_at", Tue, 18 Nov 2014 16:43:18 UTC +00:00]]
---
	def create
		@deck = find_deck
		@card = @deck.cards.new(card_params)
		@card.save

DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 18]]
DELETE FROM "decks" WHERE "decks"."id" = ?  [["id", 2]]
---
	def destroy
		@deck = find_deck
		@card = find_card(@deck)
		@card.destroy

SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = ? AND "cards"."id" = ? LIMIT 1  [["deck_id", 6], ["id", "7"]]
---
	def edit
		@deck = find_deck
		@card = @deck.cards.find(params[:id])

SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "6"]]
---
	def find_deck
		Deck.find(params[:deck_id])

SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = ? AND "cards"."id" = ? LIMIT 1  [["deck_id", 14], ["id", "18"]]
---
	def find_card deck
		deck.cards.find(params[:id])