app/controllers/decks_controller.rb

SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "new"]]
---
	def show
	 	@deck = Deck.find(params[:id])

INSERT INTO "decks" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 14 Nov 2014 20:40:39 UTC +00:00], ["name", "here"], ["updated_at", Fri, 14 Nov 2014 20:40:39 UTC +00:00]]
---
	def create
		@deck = Deck.new(deck_params)
		@deck.save

SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
		@deck = Deck.find(params[:id])

SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "decks" SET "name" = ?, "updated_at" = ? WHERE "decks"."id" = 12  [["name", "Simpl Name"], ["updated_at", Tue, 18 Nov 2014 16:30:09 UTC +00:00]]
---
	def update
		@deck = Deck.find(params[:id])
		@deck.update_attributes(deck_params)

SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "decks" WHERE "decks"."id" = ?  [["id", 2]]
---
	def destroy
		@deck = Deck.find(params[:id])
		@deck.destroy