app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 19 Nov 2014 15:52:35 UTC +00:00], ["updated_at", Wed, 19 Nov 2014 15:52:35 UTC +00:00]]
---
	def create
		@user = User.new(params[:user])
		@user.save